research/visualization_methods/outputs/Learning Dynamics with VAEs__ssm_vae/ssm_vae.dot
digraph G {
  "5" [label="5"];
  "ContinuousTransition" [label="ContinuousTransition"];
  "H_matrix" [label="H_matrix"];
  "Hₛ" [label="Hₛ"];
  "MvNormal" [label="MvNormal"];
  "MvNormalMeanCovariance" [label="MvNormalMeanCovariance"];
  "VAENode" [label="VAENode"];
  "Wishart" [label="Wishart"];
  "abs" [label="abs"];
  "angle_error" [label="angle_error"];
  "animateforiin1length" [label="animateforiin1length"];
  "atan" [label="atan"];
  "axis" [label="axis"];
  "continuation_animation" [label="continuation_animation"];
  "det" [label="det"];
  "det_H" [label="det_H"];
  "digit_indices" [label="digit_indices"];
  "eigen" [label="eigen"];
  "eigen_vals, eigen_vecs" [label="eigen_vals, eigen_vecs"];
  "end" [label="end"];
  "falseaspect_ratioequalsize" [label="falseaspect_ratioequalsize"];
  "falsecolorbarfalseaspect_ratioequalsize" [label="falsecolorbarfalseaspect_ratioequalsize"];
  "findall" [label="findall"];
  "first" [label="first"];
  "for" [label="for"];
  "generate_rotated_sequence" [label="generate_rotated_sequence"];
  "grid" [label="grid"];
  "h" [label="h"];
  "ideal" [label="ideal"];
  "img" [label="img"];
  "img_4d" [label="img_4d"];
  "img_height" [label="img_height"];
  "img_height, img_width" [label="img_height, img_width"];
  "img_width" [label="img_width"];
  "is_pure_rotation" [label="is_pure_rotation"];
  "isapprox" [label="isapprox"];
  "last" [label="last"];
  "layout" [label="layout"];
  "length" [label="length"];
  "n_obs" [label="n_obs"];
  "n_pred_to_show" [label="n_pred_to_show"];
  "norm" [label="norm"];
  "norm_H" [label="norm_H"];
  "obs_strip" [label="obs_strip"];
  "obs_tick_labels" [label="obs_tick_labels"];
  "obs_tick_pos" [label="obs_tick_pos"];
  "p1" [label="p1"];
  "p2" [label="p2"];
  "plot" [label="plot"];
  "pred_strip" [label="pred_strip"];
  "pred_tick_labels" [label="pred_tick_labels"];
  "pred_tick_pos" [label="pred_tick_pos"];
  "println("Determinant: $(round(det_H, digits" [label="println("Determinant: $(round(det_H, digits"];
  "println("Eigenvalues: $(round_(abs_(eigen_vals), digits" [label="println("Eigenvalues: $(round.(abs.(eigen_vals), digits"];
  "pure" [label="pure"];
  "q" [label="q"];
  "q(Hₛ)" [label="q(Hₛ)"];
  "q(x, Hₛ, Λₛ)" [label="q(x, Hₛ, Λₛ)"];
  "q(Λₛ)" [label="q(Λₛ)"];
  "range" [label="range"];
  "real_latent_dim1" [label="real_latent_dim1"];
  "real_latent_dim2" [label="real_latent_dim2"];
  "reshape" [label="reshape"];
  "rotated_data" [label="rotated_data"];
  "rotated_train_labels" [label="rotated_train_labels"];
  "rotation_angle" [label="rotation_angle"];
  "rotation_anim" [label="rotation_anim"];
  "rotation_animation" [label="rotation_animation"];
  "sample_image" [label="sample_image"];
  "size" [label="size"];
  "ssm_vae" [label="ssm_vae"];
  "ssm_vae_model" [label="ssm_vae_model"];
  "string" [label="string"];
  "t" [label="t"];
  "transition(h)" [label="transition(h)"];
  "x" [label="x"];
  "y" [label="y"];
  "y_pred" [label="y_pred"];
  "zeros" [label="zeros"];
  "Λ" [label="Λ"];
  "Λₛ" [label="Λₛ"];
  "Σ" [label="Σ"];
  "μ" [label="μ"];
  "5" -> "println("Determinant: $(round(det_H, digits";
  "5" -> "println("Eigenvalues: $(round_(abs_(eigen_vals), digits";
  "ContinuousTransition" -> "x";
  "H_matrix" -> "det_H";
  "H_matrix" -> "eigen_vals, eigen_vecs";
  "H_matrix" -> "norm_H";
  "H_matrix" -> "rotation_angle";
  "Hₛ" -> "x";
  "MvNormal" -> "Hₛ";
  "MvNormal" -> "x";
  "MvNormalMeanCovariance" -> "q(Hₛ)";
  "VAENode" -> "y";
  "Wishart" -> "q(Λₛ)";
  "Wishart" -> "Λₛ";
  "abs" -> "angle_error";
  "animateforiin1length" -> "continuation_animation";
  "animateforiin1length" -> "rotation_animation";
  "atan" -> "rotation_angle";
  "det" -> "det_H";
  "det_H" -> "is_pure_rotation";
  "eigen" -> "eigen_vals, eigen_vecs";
  "end" -> "H_matrix";
  "end" -> "p1";
  "end" -> "p2";
  "falseaspect_ratioequalsize" -> "axis";
  "falsecolorbarfalseaspect_ratioequalsize" -> "axis";
  "findall" -> "digit_indices";
  "first" -> "real_latent_dim1";
  "for" -> "println("Determinant: $(round(det_H, digits";
  "generate_rotated_sequence" -> "rotation_anim";
  "grid" -> "layout";
  "h" -> "transition(h)";
  "ideal" -> "println("Determinant: $(round(det_H, digits";
  "img" -> "img_4d";
  "img_height" -> "obs_strip";
  "img_height" -> "pred_strip";
  "img_width" -> "obs_strip";
  "img_width" -> "pred_strip";
  "isapprox" -> "is_pure_rotation";
  "last" -> "real_latent_dim2";
  "length" -> "n_obs";
  "n_obs" -> "obs_strip";
  "n_obs" -> "obs_tick_labels";
  "n_pred_to_show" -> "pred_strip";
  "norm" -> "norm_H";
  "plot" -> "p1";
  "plot" -> "p2";
  "pure" -> "println("Determinant: $(round(det_H, digits";
  "q" -> "q(x, Hₛ, Λₛ)";
  "range" -> "obs_tick_pos";
  "range" -> "pred_tick_pos";
  "reshape" -> "H_matrix";
  "reshape" -> "img_4d";
  "reshape" -> "transition(h)";
  "rotated_data" -> "n_obs";
  "rotated_train_labels" -> "digit_indices";
  "rotation_angle" -> "angle_error";
  "rotation_anim" -> "rotation_animation";
  "sample_image" -> "rotation_anim";
  "size" -> "img_height, img_width";
  "ssm_vae" -> "ssm_vae_model";
  "string" -> "obs_tick_labels";
  "string" -> "pred_tick_labels";
  "t" -> "y";
  "x" -> "x";
  "x" -> "y";
  "y_pred" -> "continuation_animation";
  "y_pred" -> "img_height, img_width";
  "zeros" -> "obs_strip";
  "zeros" -> "pred_strip";
  "Λ" -> "Hₛ";
  "Λₛ" -> "x";
  "Σ" -> "x";
  "μ" -> "Hₛ";
  "μ" -> "x";
}
